In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings('ignore')

In [2]:
data = pd.read_csv('bank-full.csv', sep=';')

In [3]:
pd.set_option('display.max_columns', 30)

In [4]:
data.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no

In [5]:
data.shape

(45211, 17)

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45211 entries, 0 to 45210
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        45211 non-null  int64
 1   job        45211 non-null  object
 2   marital    45211 non-null  object
 3   education  45211 non-null  object
 4   default    45211 non-null  object
 5   balance    45211 non-null  int64
 6   housing    45211 non-null  object
 7   loan       45211 non-null  object
 8   contact    45211 non-null  object
 9   day        45211 non-null  int64
 10  month      45211 non-null  object
 11  duration   45211 non-null  int64
 12  campaign   45211 non-null  int64
 13  pdays      45211 non-null  int64
 14  previous   45211 non-null  int64
 15  poutcome   45211 non-null  object
 16  y          45211 non-null  object
dtypes: int64(7), object(10)
memory usage: 5.9+ MB

In [7]:
data.isna().sum()

age          0
job          0
marital      0
education    0
default      0
balance      0
housing      0
loan         0
contact      0
day          0
month        0
duration     0
campaign     0
pdays        0
previous     0
poutcome     0
y            0
dtype: int64

In [8]:
data['job'].unique()

array(['management', 'technician', 'entrepreneur', 'blue-collar',
       'unknown', 'retired', 'admin.', 'services', 'self-employed',
       'unemployed', 'housemaid', 'student'], dtype=object)

In [9]:
data['education'].value_counts()

secondary    23202
tertiary     13301
primary       6851
unknown       1857
Name: education, dtype: int64

In [10]:
data['job'].value_counts()

blue-collar      9732
management       9458
technician       7597
admin.           5171
services         4154
retired          2264
self-employed    1579
entrepreneur     1487
unemployed       1303
housemaid        1240
student           938
unknown           288
Name: job, dtype: int64

In [11]:
data['contact'].value_counts()

cellular     29285
unknown      13020
telephone     2906
Name: contact, dtype: int64

In [12]:
data['poutcome'].value_counts()

unknown    36959
failure     4901
other       1840
success     1511
Name: poutcome, dtype: int64

In [13]:
# Data Cleaning

In [14]:
# Deleting the rows which column 'poutcome' contains 'other'
df_condition = data.poutcome == 'other'
df1 = data.drop(data[df_condition].index, axis=0, inplace=False)

In [15]:
df1['poutcome'].value_counts()

unknown    36959
failure     4901
success     1511
Name: poutcome, dtype: int64

In [16]:
# Replacing 'unknown' in job and education with 'others'
df1[['job', 'education']] = df1[['job', 'education']].replace(['unknown'], 'other')

In [17]:
from scipy.stats import zscore

In [18]:
df1[['balance']].mean()

balance    1356.963063
dtype: float64

In [19]:
df1['balance_outliers'] = df1['balance']
df1['balance_outliers'] = zscore(df1['balance_outliers'])

In [20]:
df1['balance_outliers']

0        0.259339
1       -0.438138
2       -0.447047
3        0.049172
4       -0.447377
           ...
45205   -0.281090
45206   -0.175512
45207    0.122747
45208    1.437859
45209   -0.227311
Name: balance_outliers, Length: 43371, dtype: float64

In [21]:
df_condition2 = (df1['balance_outliers'] > 3) | (df1['balance_outliers'] < -3)
df2 = df1.drop(df1[df_condition2].index, axis=0, inplace=False)

In [22]:
df2.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y,balance_outliers
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no,0.259339
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no,-0.438138
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no,-0.447047
3,47,blue-collar,married,other,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no,0.049172
4,33,other,single,other,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no,-0.447377

In [23]:
df3 = df2.drop('balance_outliers', axis=1)

In [24]:
df3.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,47,blue-collar,married,other,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,33,other,single,other,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no

In [25]:
# Creating and transforming the data
# changing column name y to 'response'
df3.rename(index=str, columns={'y' : 'response'}, inplace=True)

In [26]:
def convert(df3, new_col, old_col):
    df3[new_col] = df3[old_col].apply(lambda x: 0 if x == 'no' else 1)
    return df3[new_col].value_counts()
convert(df3, "response_binary", "response")

0    37785
1     4870
Name: response_binary, dtype: int64

In [27]:
# Removing unwanted columns
df4 = df3.drop('contact', axis=1)

In [28]:
# changing the unit of column 'duration'
df4['duration'] = df4['duration'].apply(lambda n:n/60).round(2)

In [29]:
df4['month'].unique()

array(['may', 'jun', 'jul', 'aug', 'oct', 'nov', 'dec', 'jan', 'feb',
       'mar', 'apr', 'sep'], dtype=object)

In [30]:
# Changing 'month' from words to numbers for easier analysis
lst = [df4]
for column in lst:
    column.loc[column["month"] == "jan", "month_int"] = 1
    column.loc[column["month"] == "feb", "month_int"] = 2
    column.loc[column["month"] == "mar", "month_int"] = 3
    column.loc[column["month"] == "apr", "month_int"] = 4
    column.loc[column["month"] == "may", "month_int"] = 5
    column.loc[column["month"] == "jun", "month_int"] = 6
    column.loc[column["month"] == "jul", "month_int"] = 7
    column.loc[column["month"] == "aug", "month_int"] = 8
    column.loc[column["month"] == "sep", "month_int"] = 9
    column.loc[column["month"] == "oct", "month_int"] = 10
    column.loc[column["month"] == "nov", "month_int"] = 11
    column.loc[column["month"] == "dec", "month_int"] = 12

In [31]:
df4.head()

,age,job,marital,education,default,balance,housing,loan,day,month,duration,campaign,pdays,previous,poutcome,response,response_binary,month_int
0,58,management,married,tertiary,no,2143,yes,no,5,may,4.35,1,-1,0,unknown,no,0,5.0
1,44,technician,single,secondary,no,29,yes,no,5,may,2.52,1,-1,0,unknown,no,0,5.0
2,33,entrepreneur,married,secondary,no,2,yes,yes,5,may,1.27,1,-1,0,unknown,no,0,5.0
3,47,blue-collar,married,other,no,1506,yes,no,5,may,1.53,1,-1,0,unknown,no,0,5.0
4,33,other,single,other,no,1,no,no,5,may,3.30,1,-1,0,unknown,no,0,5.0

In [32]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
Index: 42655 entries, 0 to 45209
Data columns (total 18 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   age              42655 non-null  int64
 1   job              42655 non-null  object
 2   marital          42655 non-null  object
 3   education        42655 non-null  object
 4   default          42655 non-null  object
 5   balance          42655 non-null  int64
 6   housing          42655 non-null  object
 7   loan             42655 non-null  object
 8   day              42655 non-null  int64
 9   month            42655 non-null  object
 10  duration         42655 non-null  float64
 11  campaign         42655 non-null  int64
 12  pdays            42655 non-null  int64
 13  previous         42655 non-null  int64
 14  poutcome         42655 non-null  object
 15  response         42655 non-null  object
 16  response_binary  42655 non-null  int64
 17  month_int        42655 non-null  float64
dtypes: float64(2), int64(7), object(9)
memory usage: 6.2+ MB

In [33]:
# Filtering
# drop rows that duration < 5
df_condition3 = (df4['duration'] < 5/60)
df5 = df4.drop(df4[df_condition3].index, axis=0, inplace = False)

In [34]:
# drop customer values with 'other' education
df_condition4 = (df5['education'] == 'other')
df6 = df5.drop(df5[df_condition4].index, axis = 0, inplace = False)

In [35]:
df6.head()

,age,job,marital,education,default,balance,housing,loan,day,month,duration,campaign,pdays,previous,poutcome,response,response_binary,month_int
0,58,management,married,tertiary,no,2143,yes,no,5,may,4.35,1,-1,0,unknown,no,0,5.0
1,44,technician,single,secondary,no,29,yes,no,5,may,2.52,1,-1,0,unknown,no,0,5.0
2,33,entrepreneur,married,secondary,no,2,yes,yes,5,may,1.27,1,-1,0,unknown,no,0,5.0
5,35,management,married,tertiary,no,231,yes,no,5,may,2.32,1,-1,0,unknown,no,0,5.0
6,28,management,single,tertiary,no,447,yes,yes,5,may,3.62,1,-1,0,unknown,no,0,5.0

In [36]:
df6.drop(['marital'],axis=1, inplace=True)
df6 = df6.iloc[:, 0:7]

In [ ]:
df6 = pd.get_dummies(df6, columns = ['job'])
df6 = pd.get_dummies(df6, columns = ['education'])
df6['housing'] = df6['housing'].map({'yes': 1, 'no': 0})
df6['default'] = df6['default'].map({'yes': 1, 'no': 0})
df6['loan'] = df6['loan'].map({'yes': 1, 'no': 0})

In [46]:
dataset_response = pd.DataFrame(df4['response_binary'])
df6 = pd.merge(df6, dataset_response, left_index = True, right_index = True)

In [47]:
df6.head()

,age,default,balance,housing,loan,job_admin.,job_blue-collar,job_entrepreneur,job_housemaid,job_management,job_other,job_retired,job_self-employed,job_services,job_student,job_technician,job_unemployed,education_primary,education_secondary,education_tertiary,response_binary
0,58,0,2143,1,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,1,0
1,44,0,29,1,0,0,0,0,0,0,0,0,0,0,0,1,0,0,1,0,0
2,33,0,2,1,1,0,0,1,0,0,0,0,0,0,0,0,0,0,1,0,0
5,35,0,231,1,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,1,0
6,28,0,447,1,1,0,0,0,0,1,0,0,0,0,0,0,0,0,0,1,0

In [42]:
array = df6.values

In [50]:
X = array[:,0:-1]

In [48]:
Y = array[:,-1]

In [49]:
Y

array([1, 0, 0, ..., 0, 0, 0], dtype=int64)

In [51]:
from sklearn.model_selection import train_test_split

In [52]:
X_train, X_test, Y_train, Y_test = train_test_split(X, Y, test_size=0.2, random_state=42)

In [53]:
from sklearn.tree import DecisionTreeClassifier

In [54]:
DT = DecisionTreeClassifier()
DT.fit(X_train, Y_train)
y_pred = DT.predict(X_test)

In [55]:
from sklearn.metrics import ConfusionMatrixDisplay, accuracy_score, classification_report

In [56]:
print(accuracy_score(Y_test, y_pred))
print(classification_report(Y_test, y_pred))

1.0
              precision    recall  f1-score   support

           0       1.00      1.00      1.00      5643
           1       1.00      1.00      1.00      2526

    accuracy                           1.00      8169
   macro avg       1.00      1.00      1.00      8169
weighted avg       1.00      1.00      1.00      8169